vcr_cassettes/declined_stripe_charge.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=999&currency=usd&description=Subscription+fee+for+joesmith%40gmail.com&source=tok_17bjyiFvLN3VTDgcWTlKrq4U
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.31.0
      Authorization:
      - Bearer sk_test_0vdTk4grYlkcId7ty2LaDrpO
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.31.0","lang":"ruby","lang_version":"2.1.7 p400 (2015-08-18)","platform":"x86_64-darwin14.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        DeShawns-MBP 14.4.0 Darwin Kernel Version 14.4.0: Thu May 28 11:35:04 PDT
        2015; root:xnu-2782.30.5~1/RELEASE_X86_64 x86_64","hostname":"DeShawns-MBP"}'
      Content-Length:
      - '113'
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Sun, 07 Feb 2016 04:16:53 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '162'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7rSuDHlDOHbWGh
      Stripe-Version:
      - '2015-10-16'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Your card was declined.",
            "type": "card_error",
            "code": "card_declined",
            "charge": "ch_17bjyjFvLN3VTDgcRzcGQlj6"
          }
        }
    http_version: 
  recorded_at: Sun, 07 Feb 2016 04:16:54 GMT
recorded_with: VCR 3.0.1
